app/controllers/api/v1/pitches_controller.rb

  def landing_index
    respond_with Pitch.all.limit(8)
---
SELECT  "pitches".* FROM "pitches" LIMIT $1  [["LIMIT", 8]]

  def index
    # respond_with Pitch.search(params)
    if current_user.is_dev
      if params[:user_id] == current_user.id.to_s
        respond_with Pitch.where(user_id: params[:user_id])
---
SELECT "pitches".* FROM "pitches" WHERE "pitches"."user_id" = $1  [["user_id", 8]]

  def show
    if params[:user_id] == current_user.id.to_s
      respond_with Pitch.where(id: params[:id], user_id: params[:user_id]).first
---
SELECT  "pitches".* FROM "pitches" WHERE "pitches"."id" = $1 AND "pitches"."user_id" = $2 ORDER BY "pitches"."id" ASC LIMIT $3  [["id", 1], ["user_id", 1], ["LIMIT", 1]]

  def create
    if current_user.is_dev == true
      pitch = current_user.pitches.build(pitch_params)
      if pitch.save
---
INSERT INTO "pitches" ("title", "body", "video", "expected_release_date", "website", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def update
    pitch = current_user.pitches.find(params[:id])
    if pitch.update(pitch_params)
---
SELECT  "pitches".* FROM "pitches" WHERE "pitches"."user_id" = $1 AND "pitches"."id" = $2 LIMIT $3  [["user_id", 19], ["id", 33], ["LIMIT", 1]]
UPDATE "pitches" SET "title" = $1, "updated_at" = $2 WHERE "pitches"."id" = $3  [["title", "An expensive TV"], ["updated_at", 2017-01-18 02:45:31 UTC], ["id", 33]]

  def destroy
    pitch = current_user.pitches.find(params[:id])
    pitch.destroy
---
SELECT  "pitches".* FROM "pitches" WHERE "pitches"."user_id" = $1 AND "pitches"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
DELETE FROM "pitches" WHERE "pitches"."id" = $1  [["id", 1]]