app/controllers/api/v1/sessions_controller.rb

  def create
    user_password = params[:session][:password]
    user_email = params[:session][:email]
    user = user_email.present? && User.find_by(email: user_email)

    if user && user.valid_password?(user_password)
      sign_in user, store: false #DIDI CHECK IF NEEDED STORE FALSE
      user.generate_authentication_token!

      # puts sign_in(user)
      puts current_user
      # current_user = user
      # puts current_user.save(validate: false)
      # puts "SEE IF I SAVE THE MOTHERFUCKING USER!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"
      # puts 'the user'
      # puts user
      # puts 'is signed in?'
      # puts user_signed_in?
      # puts current_user
            # puts '$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$'

      # puts user_session

      # puts current_user == user
      # puts '@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@'
      user.save
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "first@devadmin.com"], ["LIMIT", 1]]
UPDATE "users" SET "current_sign_in_at" = $1, "last_sign_in_at" = $2, "sign_in_count" = $3, "updated_at" = $4 WHERE "users"."id" = $5  [["current_sign_in_at", 2017-01-16 04:46:50 UTC], ["last_sign_in_at", 2017-01-16 04:35:02 UTC], ["sign_in_count", 3], ["updated_at", 2017-01-16 04:46:50 UTC], ["id", 1]]

  def destroy
    if user = User.where(auth_token: request.headers["Authorization"], id: params[:id]).first
      # p '!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!'
      # p 'auth_token'
      # p params[:id]
      # p user
      # p request.headers["Authorization"]
      user.generate_authentication_token!
      user.save
---
SELECT  "users".* FROM "users" WHERE "users"."auth_token" = $1 AND "users"."id" = $2 ORDER BY "users"."id" ASC LIMIT $3  [["auth_token", "kfi8pfSsrcEUXmZxg6vj"], ["id", 85], ["LIMIT", 1]]
UPDATE "users" SET "auth_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["auth_token", "QbSzzYfdMnY3zVcrXeJQ"], ["updated_at", 2017-01-18 02:45:38 UTC], ["id", 85]]