app/controllers/api/v1/submissions_controller.rb

SELECT  "submissions".* FROM "submissions" WHERE "submissions"."dev_id" = $1 AND "submissions"."id" = $2 LIMIT $3  [["dev_id", 96], ["id", 23], ["LIMIT", 1]]
---
	def show
	  	if current_user.is_dev != false
	    	respond_with current_user.submissions.find(params[:id])

INSERT INTO "submissions" ("pitch_id", "created_at", "updated_at", "dev_id", "influencer_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["pitch_id", 97], ["created_at", 2017-01-18 02:45:41 UTC], ["updated_at", 2017-01-18 02:45:41 UTC], ["dev_id", 100], ["influencer_id", 101]]
---
	def create
		if current_user.is_dev?
		  # submission = current_user.submissions.build(submission_params.except(:is_approved, :feedback))
		  submission = current_user.submissions.build(dev_submission_params)

		  if submission.save