app/controllers/api/v1/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
  def show
    puts '@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@'

    puts current_user
    puts '@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@'
    respond_with User.find(params[:id])

SELECT "users".* FROM "users" WHERE "users"."is_dev" = $1  [["is_dev", false]]
---
  def index
    # if current_user.is_dev
      respond_with User.where(is_dev: false)

INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at", "auth_token") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    user = User.new(user_params)
    if user.save

UPDATE "users" SET "email" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["email", "newmail@example.com"], ["updated_at", 2017-01-18 02:45:42 UTC], ["id", 109]]
---
  def update
    user = current_user
    if user.is_dev
      if user.update(user_params)

DELETE FROM "users" WHERE "users"."id" = $1  [["id", 119]]
---
  def destroy
    current_user.destroy